Проект базы данных для онлайн шахмат.

На chess.com пользователи могут играть друг с другом в режиме разовой партии или турнира,
а так же решать шахматные задачи.

База данных хранит:
- информацию о пользователе, его игровом рейтинге;
- архив сыгранных партий;
- коллекцию шахматных задач;
- информацию о созданных турнирах;
- информацию о клубах;
- принадлежность пользователей к клубам;
- запись пользователей на турниры;
- прогресс пользователей в решении задач;
- новости публикуемые организаторами сайта или создателями клубов;
- отношение новости к опубликовавшему ее клубу (новость может быть опубликована в нескольких клубах одновременно);